; domain
(define (domain default)
  (:requirements :strips :adl :typing)  ; Domain capabilities.
  (:types
    agent workstation warehouse box supply - locatable  ; Object supply_types.
    location supply_type carrier - object
    capacity - object
  )
  (:predicates
    (adjacent ?l1 ?l2 - location)       ; Two locations are adjacent.
    (at ?o - locatable ?l - location)  ; An object is at a specific location.
    (empty ?b - box)   ; A box is empty.
    (free_arms ?a - agent) ; An agent has free arms (not carrying a box).
    (available ?b - box)
    (contains ?b - box ?s - supply) ; A box contains a specific supply.
    (is ?s - supply ?t -  supply_type) ; A supply is of a specific supply_type.
    (has ?ws - workstation ?t - supply_type) ; A workstation requires a supply of a specific supply_type.
    (loaded_to ?s - supply ?ws - workstation) ; A supply has been loaded onto a workstation.
    (attached ?c - carrier ?a - agent) ; A carrier is attached to an agent.
    (on ?c - carrier ?b - box) ; A box is on a carrier.
      ;; capacity
    (carrier_capacity ?c - carrier ?cap - capacity)
    (predecessor ?cap0 - capacity ?cap1 - capacity)
  )

  ;; Action definitions
  (:action move
    :parameters (?a - agent ?from ?to - location)
    :precondition (and 
      (adjacent ?from ?to)  ; The agent must move between adjacent locations.
      (at ?a ?from)  ; The agent must be at the starting location.
    )
    :effect (and 
      (at ?a ?to)  ; The agent is now at the destination location.
      (not (at ?a ?from))  ; The agent is no longer at the starting location.
    )
  )


  (:action load_box
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?c0 - capacity ?c1 - capacity)
    :precondition (and 
      (at ?b ?l)  ; The box must be at the agent's location.
      (at ?a ?l)  ; The agent must be at the location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (free_arms ?a)  ; The agent must have free arms.
      (available ?b)  ; The box must be available.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c1)
    )
    :effect (and 
      (on ?c ?b)  ; The box is now on the carrier.
      (not (at ?b ?l))  ; The box is no longer at the location.
      (not (available ?b))  ; The box is no longer available to be carried by an agent.
      (carrier_capacity ?c ?c0)
      (not (carrier_capacity ?c ?c1))    
    )
  )

  (:action leave_box
    :parameters (?a - agent ?c - carrier ?b - box ?l - location ?wh - warehouse ?c0 - capacity ?c1 - capacity)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the location.
      (at ?wh ?l)  ; The warehouse must be at the location.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
      (on ?c ?b)  ; The box must be on the carrier.
      (free_arms ?a)  ; The agent must have free arms.
      (predecessor ?c0 ?c1)
      (carrier_capacity ?c ?c0)
    )
    :effect (and 
      (not (on ?c ?b))  ; The box is no longer on the carrier.
      (at ?b ?l)  ; The box is now at the location.
      (available ?b)  ; The box is now available to be carried by an agent.
      (carrier_capacity ?c ?c1)
      (not (carrier_capacity ?c ?c0))    
    )
  )

  (:action fill_box
    :parameters (?a - agent ?b - box ?c - carrier ?s - supply ?l - location)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the location.
      (at ?s ?l)  ; The supply must be at the location.
      (empty ?b)  ; The box must be empty.
      (on ?c ?b)
      (attached ?c ?a)  ; The carrier must be attached to the agent.
    )
    :effect (and 
      (not (empty ?b))  ; The box is no longer empty.
      (contains ?b ?s)  ; The box now contains the supply.
      (not (at ?s ?l))  ; The supply is no longer at the location.
    )
  )
  
  (:action deliver_supply_to_workstation
    :parameters (?a - agent ?ws - workstation ?b - box ?s - supply ?l - location ?t - supply_type ?c - carrier)
    :precondition (and 
      (at ?a ?l)  ; The agent must be at the workstation's location.
      (at ?ws ?l)  ; The workstation must be at the location.
      (contains ?b ?s)  ; The box must contain the supply.
      (on ?c ?b)  ; The box must be on the carrier.
      (is ?s ?t)  ; The supply must be of the required supply_type.
      (attached ?c ?a)  ; The carrier must be attached to the agent.
    )
    :effect (and 
      (loaded_to ?s ?ws)  ; The supply is now loaded to the workstation.
      (not (contains ?b ?s))  ; The box no longer contains the supply.
      (empty ?b)  ; The box is now empty.
      (has ?ws ?t)  ; The workstation now has the required supply supply_type.
    )
  )
)

; problem
;; problem file: problem_2.pddl
(define (problem default)
  (:domain default)
  (:objects l0_2 l4_1 l4_3 l3_2 l4_0 l2_1 l3_0 l4_2 l3_1 l1_3 l4_4 l2_4 l0_1 l3_3 l1_4 l0_3 l2_3 l2_2 l3_4 l1_1 l1_0 l1_2 l0_0 l0_4 l2_0 - location agent_1 agent_2 agent_0 agent_3 - agent supply_7 supply_14 supply_9 supply_16 supply_13 supply_2 supply_19 supply_0 supply_3 supply_8 supply_11 supply_4 supply_10 supply_6 supply_15 supply_18 supply_1 supply_17 supply_12 supply_5 - supply box_3 box_8 box_5 box_6 box_4 box_2 box_7 box_0 box_9 box_1 - box workstation_3 workstation_0 workstation_1 workstation_2 - workstation warehouse_0 - warehouse carrier_1 carrier_0 carrier_3 carrier_2 - carrier circuit gear tool bolt valve - supply_type capacity_1 capacity_3 capacity_4 capacity_2 capacity_5 capacity_7 capacity_0 capacity_6 - capacity )
  (:init (at workstation_2 l4_1) (adjacent l1_0 l2_0) (at supply_5 l2_1) (at agent_1 l2_1) (carrier_capacity carrier_2 capacity_3) (at box_9 l2_1) (empty box_9) (empty box_8) (adjacent l3_2 l2_2) (adjacent l1_1 l1_0) (available box_6) (available box_9) (free_arms agent_0) (at supply_6 l2_1) (empty box_6) (adjacent l4_3 l4_2) (adjacent l3_2 l4_2) (adjacent l2_1 l3_1) (is supply_2 valve) (at box_3 l2_1) (adjacent l2_1 l2_0) (adjacent l1_1 l2_1) (adjacent l0_0 l1_0) (adjacent l4_0 l4_1) (is supply_17 circuit) (adjacent l4_1 l3_1) (is supply_8 tool) (at supply_0 l2_1) (at warehouse_0 l2_1) (adjacent l4_0 l3_0) (attached carrier_0 agent_0) (adjacent l2_3 l3_3) (adjacent l1_3 l2_3) (empty box_7) (is supply_5 bolt) (at supply_2 l2_1) (adjacent l3_2 l3_3) (predecessor capacity_3 capacity_4) (at workstation_0 l1_2) (adjacent l0_4 l1_4) (adjacent l0_1 l0_2) (is supply_4 bolt) (is supply_13 gear) (is supply_1 valve) (adjacent l2_4 l3_4) (empty box_5) (adjacent l2_4 l2_3) (adjacent l0_3 l0_4) (at agent_3 l2_1) (adjacent l3_3 l2_3) (adjacent l1_2 l1_3) (at supply_1 l2_1) (adjacent l4_4 l4_3) (available box_7) (adjacent l1_2 l1_1) (at box_1 l2_1) (adjacent l3_4 l2_4) (at box_6 l2_1) (at supply_7 l2_1) (at agent_0 l2_1) (adjacent l3_1 l4_1) (adjacent l3_4 l3_3) (free_arms agent_1) (adjacent l1_2 l2_2) (is supply_16 circuit) (adjacent l1_4 l0_4) (adjacent l4_4 l3_4) (at supply_16 l2_1) (at box_8 l2_1) (adjacent l1_2 l0_2) (empty box_0) (adjacent l3_1 l3_2) (carrier_capacity carrier_3 capacity_5) (adjacent l4_2 l4_1) (attached carrier_3 agent_3) (at supply_8 l2_1) (at workstation_1 l3_2) (free_arms agent_3) (adjacent l3_4 l4_4) (at supply_18 l2_1) (at supply_13 l2_1) (is supply_14 gear) (at supply_12 l2_1) (is supply_19 circuit) (loaded_to supply_15 workstation_0) (available box_2) (predecessor capacity_5 capacity_6) (at supply_3 l2_1) (adjacent l4_1 l4_0) (available box_1) (carrier_capacity carrier_0 capacity_6) (at box_4 l2_1) (adjacent l3_0 l2_0) (adjacent l2_1 l1_1) (adjacent l1_3 l1_2) (adjacent l3_3 l3_4) (adjacent l2_2 l2_3) (predecessor capacity_2 capacity_3) (at supply_11 l2_1) (at workstation_3 l1_1) (is supply_18 circuit) (is supply_7 bolt) (adjacent l4_3 l4_4) (is supply_15 gear) (attached carrier_2 agent_2) (at supply_19 l2_1) (adjacent l0_0 l0_1) (adjacent l1_3 l0_3) (adjacent l3_3 l4_3) (adjacent l3_1 l2_1) (at supply_17 l2_1) (adjacent l2_3 l2_4) (adjacent l1_3 l1_4) (available box_4) (adjacent l4_3 l3_3) (available box_5) (adjacent l0_2 l0_3) (predecessor capacity_1 capacity_2) (adjacent l0_4 l0_3) (empty box_3) (adjacent l4_2 l3_2) (at supply_10 l2_1) (adjacent l3_0 l3_1) (adjacent l2_1 l2_2) (is supply_0 valve) (adjacent l4_1 l4_2) (at supply_14 l2_1) (adjacent l2_2 l3_2) (at supply_15 l2_1) (adjacent l2_0 l3_0) (adjacent l1_4 l1_3) (empty box_1) (at agent_2 l2_1) (is supply_9 tool) (adjacent l2_2 l2_1) (predecessor capacity_0 capacity_1) (predecessor capacity_4 capacity_5) (predecessor capacity_6 capacity_7) (adjacent l0_3 l1_3) (is supply_12 gear) (at supply_9 l2_1) (adjacent l2_4 l1_4) (empty box_4) (is supply_6 bolt) (adjacent l0_2 l0_1) (adjacent l3_3 l3_2) (adjacent l2_2 l1_2) (adjacent l3_1 l3_0) (adjacent l0_1 l0_0) (available box_3) (free_arms agent_2) (adjacent l1_0 l0_0) (adjacent l1_4 l2_4) (adjacent l1_0 l1_1) (available box_8) (at box_0 l2_1) (carrier_capacity carrier_1 capacity_6) (attached carrier_1 agent_1) (adjacent l2_0 l2_1) (available box_0) (empty box_2) (adjacent l1_1 l1_2) (adjacent l2_3 l2_2) (adjacent l0_3 l0_2) (at supply_4 l2_1) (is supply_10 tool) (adjacent l3_2 l3_1) (is supply_11 tool) (adjacent l0_1 l1_1) (at box_2 l2_1) (adjacent l1_1 l0_1) (loaded_to supply_17 workstation_2) (is supply_3 valve) (adjacent l2_3 l1_3) (adjacent l3_0 l4_0) (adjacent l2_0 l1_0) (adjacent l0_2 l1_2) (adjacent l4_2 l4_3) (at box_7 l2_1) (at box_5 l2_1))
  (:goal (and (has workstation_0 circuit) (has workstation_1 tool) (has workstation_1 bolt) (has workstation_1 circuit) (has workstation_3 tool) (has workstation_3 bolt) (has workstation_2 gear) (has workstation_1 gear) (has workstation_2 tool) (has workstation_3 gear) (has workstation_2 valve) (has workstation_1 valve) (has workstation_0 valve) (has workstation_3 circuit) (has workstation_0 bolt)))
)

; plan
1. (load_box agent_0 carrier_0 box_1 l2_1 capacity_5 capacity_6)
   deleted: (at box_1 l2_1) (available box_1) (carrier_capacity carrier_0 capacity_6)
   added: (on carrier_0 box_1) (carrier_capacity carrier_0 capacity_5)
   goals met: 0 of 15
2. (fill_box agent_0 box_1 carrier_0 supply_17 l2_1)
   deleted: (empty box_1) (at supply_17 l2_1)
   added: (contains box_1 supply_17)
   goals met: 0 of 15
3. (load_box agent_0 carrier_0 box_9 l2_1 capacity_4 capacity_5)
   deleted: (at box_9 l2_1) (available box_9) (carrier_capacity carrier_0 capacity_5)
   added: (on carrier_0 box_9) (carrier_capacity carrier_0 capacity_4)
   goals met: 0 of 15
4. (fill_box agent_0 box_9 carrier_0 supply_13 l2_1)
   deleted: (empty box_9) (at supply_13 l2_1)
   added: (contains box_9 supply_13)
   goals met: 0 of 15
5. (load_box agent_0 carrier_0 box_0 l2_1 capacity_3 capacity_4)
   deleted: (at box_0 l2_1) (available box_0) (carrier_capacity carrier_0 capacity_4)
   added: (on carrier_0 box_0) (carrier_capacity carrier_0 capacity_3)
   goals met: 0 of 15
6. (fill_box agent_0 box_0 carrier_0 supply_8 l2_1)
   deleted: (empty box_0) (at supply_8 l2_1)
   added: (contains box_0 supply_8)
   goals met: 0 of 15
7. (load_box agent_0 carrier_0 box_7 l2_1 capacity_2 capacity_3)
   deleted: (at box_7 l2_1) (available box_7) (carrier_capacity carrier_0 capacity_3)
   added: (on carrier_0 box_7) (carrier_capacity carrier_0 capacity_2)
   goals met: 0 of 15
8. (fill_box agent_0 box_7 carrier_0 supply_2 l2_1)
   deleted: (empty box_7) (at supply_2 l2_1)
   added: (contains box_7 supply_2)
   goals met: 0 of 15
9. (load_box agent_0 carrier_0 box_2 l2_1 capacity_1 capacity_2)
   deleted: (at box_2 l2_1) (available box_2) (carrier_capacity carrier_0 capacity_2)
   added: (on carrier_0 box_2) (carrier_capacity carrier_0 capacity_1)
   goals met: 0 of 15
10. (fill_box agent_0 box_2 carrier_0 supply_5 l2_1)
   deleted: (empty box_2) (at supply_5 l2_1)
   added: (contains box_2 supply_5)
   goals met: 0 of 15
11. (move agent_0 l2_1 l1_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l1_1)
   goals met: 0 of 15
12. (deliver_supply_to_workstation agent_0 workstation_3 box_2 supply_5 l1_1 bolt carrier_0)
   deleted: (contains box_2 supply_5)
   added: (loaded_to supply_5 workstation_3) (empty box_2) (has workstation_3 bolt)
   goals met: 1 of 15
13. (move agent_0 l1_1 l2_1)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l2_1)
   goals met: 1 of 15
14. (fill_box agent_0 box_2 carrier_0 supply_4 l2_1)
   deleted: (empty box_2) (at supply_4 l2_1)
   added: (contains box_2 supply_4)
   goals met: 1 of 15
15. (move agent_0 l2_1 l1_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l1_1)
   goals met: 1 of 15
16. (deliver_supply_to_workstation agent_0 workstation_3 box_1 supply_17 l1_1 circuit carrier_0)
   deleted: (contains box_1 supply_17)
   added: (loaded_to supply_17 workstation_3) (empty box_1) (has workstation_3 circuit)
   goals met: 2 of 15
17. (move agent_0 l1_1 l2_1)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l2_1)
   goals met: 2 of 15
18. (fill_box agent_0 box_1 carrier_0 supply_16 l2_1)
   deleted: (empty box_1) (at supply_16 l2_1)
   added: (contains box_1 supply_16)
   goals met: 2 of 15
19. (move agent_0 l2_1 l3_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l3_1)
   goals met: 2 of 15
20. (move agent_3 l2_1 l2_2)
   deleted: (at agent_3 l2_1)
   added: (at agent_3 l2_2)
   goals met: 2 of 15
21. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 2 of 15
22. (move agent_2 l2_1 l1_1)
   deleted: (at agent_2 l2_1)
   added: (at agent_2 l1_1)
   goals met: 2 of 15
23. (move agent_0 l3_2 l2_2)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l2_2)
   goals met: 2 of 15
24. (move agent_1 l2_1 l3_1)
   deleted: (at agent_1 l2_1)
   added: (at agent_1 l3_1)
   goals met: 2 of 15
25. (move agent_0 l2_2 l1_2)
   deleted: (at agent_0 l2_2)
   added: (at agent_0 l1_2)
   goals met: 2 of 15
26. (deliver_supply_to_workstation agent_0 workstation_0 box_1 supply_16 l1_2 circuit carrier_0)
   deleted: (contains box_1 supply_16)
   added: (loaded_to supply_16 workstation_0) (empty box_1) (has workstation_0 circuit)
   goals met: 3 of 15
27. (deliver_supply_to_workstation agent_0 workstation_0 box_7 supply_2 l1_2 valve carrier_0)
   deleted: (contains box_7 supply_2)
   added: (loaded_to supply_2 workstation_0) (empty box_7) (has workstation_0 valve)
   goals met: 4 of 15
28. (deliver_supply_to_workstation agent_0 workstation_0 box_2 supply_4 l1_2 bolt carrier_0)
   deleted: (contains box_2 supply_4)
   added: (loaded_to supply_4 workstation_0) (empty box_2) (has workstation_0 bolt)
   goals met: 5 of 15
29. (move agent_0 l1_2 l1_1)
   deleted: (at agent_0 l1_2)
   added: (at agent_0 l1_1)
   goals met: 5 of 15
30. (move agent_0 l1_1 l2_1)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l2_1)
   goals met: 5 of 15
31. (fill_box agent_0 box_1 carrier_0 supply_7 l2_1)
   deleted: (empty box_1) (at supply_7 l2_1)
   added: (contains box_1 supply_7)
   goals met: 5 of 15
32. (fill_box agent_0 box_7 carrier_0 supply_19 l2_1)
   deleted: (empty box_7) (at supply_19 l2_1)
   added: (contains box_7 supply_19)
   goals met: 5 of 15
33. (fill_box agent_0 box_2 carrier_0 supply_1 l2_1)
   deleted: (empty box_2) (at supply_1 l2_1)
   added: (contains box_2 supply_1)
   goals met: 5 of 15
34. (move agent_0 l2_1 l3_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l3_1)
   goals met: 5 of 15
35. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 5 of 15
36. (deliver_supply_to_workstation agent_0 workstation_1 box_1 supply_7 l3_2 bolt carrier_0)
   deleted: (contains box_1 supply_7)
   added: (loaded_to supply_7 workstation_1) (empty box_1) (has workstation_1 bolt)
   goals met: 6 of 15
37. (deliver_supply_to_workstation agent_0 workstation_1 box_7 supply_19 l3_2 circuit carrier_0)
   deleted: (contains box_7 supply_19)
   added: (loaded_to supply_19 workstation_1) (empty box_7) (has workstation_1 circuit)
   goals met: 7 of 15
38. (deliver_supply_to_workstation agent_0 workstation_1 box_0 supply_8 l3_2 tool carrier_0)
   deleted: (contains box_0 supply_8)
   added: (loaded_to supply_8 workstation_1) (empty box_0) (has workstation_1 tool)
   goals met: 8 of 15
39. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 8 of 15
40. (move agent_0 l3_1 l2_1)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l2_1)
   goals met: 8 of 15
41. (fill_box agent_0 box_1 carrier_0 supply_9 l2_1)
   deleted: (empty box_1) (at supply_9 l2_1)
   added: (contains box_1 supply_9)
   goals met: 8 of 15
42. (move agent_0 l2_1 l1_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l1_1)
   goals met: 8 of 15
43. (deliver_supply_to_workstation agent_0 workstation_3 box_1 supply_9 l1_1 tool carrier_0)
   deleted: (contains box_1 supply_9)
   added: (loaded_to supply_9 workstation_3) (empty box_1) (has workstation_3 tool)
   goals met: 9 of 15
44. (move agent_0 l1_1 l2_1)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l2_1)
   goals met: 9 of 15
45. (fill_box agent_0 box_1 carrier_0 supply_10 l2_1)
   deleted: (empty box_1) (at supply_10 l2_1)
   added: (contains box_1 supply_10)
   goals met: 9 of 15
46. (move agent_0 l2_1 l1_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l1_1)
   goals met: 9 of 15
47. (deliver_supply_to_workstation agent_0 workstation_3 box_9 supply_13 l1_1 gear carrier_0)
   deleted: (contains box_9 supply_13)
   added: (loaded_to supply_13 workstation_3) (empty box_9) (has workstation_3 gear)
   goals met: 10 of 15
48. (move agent_0 l1_1 l2_1)
   deleted: (at agent_0 l1_1)
   added: (at agent_0 l2_1)
   goals met: 10 of 15
49. (fill_box agent_0 box_9 carrier_0 supply_14 l2_1)
   deleted: (empty box_9) (at supply_14 l2_1)
   added: (contains box_9 supply_14)
   goals met: 10 of 15
50. (move agent_0 l2_1 l3_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l3_1)
   goals met: 10 of 15
51. (move agent_0 l3_1 l4_1)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l4_1)
   goals met: 10 of 15
52. (deliver_supply_to_workstation agent_0 workstation_2 box_1 supply_10 l4_1 tool carrier_0)
   deleted: (contains box_1 supply_10)
   added: (loaded_to supply_10 workstation_2) (empty box_1) (has workstation_2 tool)
   goals met: 11 of 15
53. (deliver_supply_to_workstation agent_0 workstation_2 box_9 supply_14 l4_1 gear carrier_0)
   deleted: (contains box_9 supply_14)
   added: (loaded_to supply_14 workstation_2) (empty box_9) (has workstation_2 gear)
   goals met: 12 of 15
54. (move agent_0 l4_1 l3_1)
   deleted: (at agent_0 l4_1)
   added: (at agent_0 l3_1)
   goals met: 12 of 15
55. (move agent_0 l3_1 l2_1)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l2_1)
   goals met: 12 of 15
56. (fill_box agent_0 box_1 carrier_0 supply_15 l2_1)
   deleted: (empty box_1) (at supply_15 l2_1)
   added: (contains box_1 supply_15)
   goals met: 12 of 15
57. (move agent_0 l2_1 l3_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l3_1)
   goals met: 12 of 15
58. (move agent_0 l3_1 l3_2)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l3_2)
   goals met: 12 of 15
59. (deliver_supply_to_workstation agent_0 workstation_1 box_1 supply_15 l3_2 gear carrier_0)
   deleted: (contains box_1 supply_15)
   added: (loaded_to supply_15 workstation_1) (empty box_1) (has workstation_1 gear)
   goals met: 13 of 15
60. (deliver_supply_to_workstation agent_0 workstation_1 box_2 supply_1 l3_2 valve carrier_0)
   deleted: (contains box_2 supply_1)
   added: (loaded_to supply_1 workstation_1) (empty box_2) (has workstation_1 valve)
   goals met: 14 of 15
61. (move agent_0 l3_2 l3_1)
   deleted: (at agent_0 l3_2)
   added: (at agent_0 l3_1)
   goals met: 14 of 15
62. (move agent_0 l3_1 l2_1)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l2_1)
   goals met: 14 of 15
63. (fill_box agent_0 box_1 carrier_0 supply_0 l2_1)
   deleted: (empty box_1) (at supply_0 l2_1)
   added: (contains box_1 supply_0)
   goals met: 14 of 15
64. (move agent_0 l2_1 l3_1)
   deleted: (at agent_0 l2_1)
   added: (at agent_0 l3_1)
   goals met: 14 of 15
65. (move agent_0 l3_1 l4_1)
   deleted: (at agent_0 l3_1)
   added: (at agent_0 l4_1)
   goals met: 14 of 15
66. (deliver_supply_to_workstation agent_0 workstation_2 box_1 supply_0 l4_1 valve carrier_0)
   deleted: (contains box_1 supply_0)
   added: (loaded_to supply_0 workstation_2) (empty box_1) (has workstation_2 valve)
   goals met: 15 of 15
